.. _demo-doc:

============================
Demonstration: Documentation
============================

Type ``plot(`` and then press the ``TAB`` key:

.. skip:

::

    sage: plot(

Click on Help at the top of this page

There is also Live Documentation in which you can evaluate the
examples.

.. TODO: put back the question marks once the live documentation
.. supports it!

Introspection::

    sage: m = matrix([[1/2,1],[2,1]]); m

.. skip:

::

    sage: m.

    sage: g = Graph(); g

    sage: g.

Looking at the sources::

    sage: m.det
